Repository: Okariuss/AIWorkflow
Catalog: AIWorkflow/AIWorkflow/*.lproj/Localizable.strings
Languages: tr

# accessibility.workflow_row
source: Workflow %@, %d steps
tr: İş akışı %@, %d adım

# accessibility.step_row
source: Step %d: %@
tr: Adım %d: %@

# accessibility.favorite_button
source: Toggle favorite
tr: Favori durumunu değiştir

# accessibility.delete_button
source: Delete workflow
tr: İş akışını sil

# accessibility.run_button
source: Run workflow
tr: İş akışını çalıştır

# accessibility.add_step_button
source: Add new step
tr: Yeni adım ekle

# accessibility.progress
source: Progress: %.0f%%
tr: İlerleme: %.0f%%

# intents.quick_run_title
source: Quick Run Workflow
tr: Hızlı Çalıştır

# intents.quick_run_description
source: Quickly run a workflow with default settings
tr: Bir iş akışını varsayılan ayarlarla hızlıca çalıştırın

# intents.quick_run_parameter_workflow
source: Workflow
tr: İş Akışı

# intents.quick_run_parameter_input_text
source: Input Text
tr: Girdi Metni

# intents.run_workflow_title
source: Run Workflow
tr: İş Akışını Çalıştır

# intents.run_workflow_description
source: Runs an AI workflow with the provided input text
tr: Sağlanan metin ile bir AI iş akışını çalıştırır

# intents.run_workflow_parameter_workflow
source: Workflow
tr: İş Akışı

# intents.run_workflow_parameter_input_text
source: Input Text
tr: Girdi Metni

# intents.run_workflow_parameter_input_text_description
source: The text to process through the workflow
tr: İş akışında işlenecek metin

# intents.run_workflow_dialog_not_found
source: I couldn't find that workflow.
tr: Bu iş akışını bulamadım.

# intents.run_workflow_dialog_done
source: Done! Check the app for results.
tr: Tamam! Sonuçları uygulamada kontrol et.

# intents.run_workflow_dialog_failed
source: Workflow failed. Check the app.
tr: İş akışı başarısız oldu. Uygulamayı kontrol et.

# intents.run_simple
source: Run a workflow in %@
tr: %@'da bir iş akışı çalıştır

# intents.run_execute
source: Execute workflow in %@
tr: %@'da iş akışı yürüt

# intents.run_workflow_name
source: Run %@ in %@
tr: %@'da %@ adlı iş akışını çalıştır

# intents.process_workflow_name
source: Process text with %@ in %@
tr: %@'da metni %@ ile işle

# activity.steps
source: Step %d of %d
tr: Adım %d / %d

# widget.configuration.display_name
source: Quick Run
tr: Hızlı Çalıştır

# widget.configuration.description
source: Quick Access to your favorite workflows
tr: Favori iş akışlarınıza hızlı erişim
