Repository: Okariuss/AIWorkflow
Catalog: AIWorkflow/AIWorkflow/*.lproj/Localizable.strings
Languages: tr

# common.save
source: Save
tr: Kaydet

# common.cancel
source: Cancel
tr: İptal

# common.delete
source: Delete
tr: Sil

# common.edit
source: Edit
tr: Düzenle

# common.done
source: Done
tr: Tamam

# common.close
source: Close
tr: Kapat

# common.add
source: Add
tr: Ekle

# common.remove
source: Remove
tr: Kaldır

# common.ok
source: OK
tr: Tamam

# common.yes
source: Yes
tr: Evet

# common.no
source: No
tr: Hayır

# common.error
source: Error
tr: Hata

# common.success
source: Success
tr: Başarılı

# common.loading
source: Loading...
tr: Yükleniyor...

# common.saving
source: Saving...
tr: Kaydediliyor...

# common.clear
source: Clear
tr: Temizle

# common.copy
source: Copy
tr: Kopyala

# common.share
source: Share
tr: Paylaş

# common.search
source: Search
tr: Ara

# common.filter
source: Filter
tr: Filtrele

# common.sort
source: Sort
tr: Sırala

# common.more
source: More
tr: Daha Fazla

# common.run
source: Run
tr: Çalıştır

# common.stop
source: Stop
tr: Durdur

# common.retry
source: Retry
tr: Yeniden Dene

# common.seconds
source: seconds
tr: saniye

# workflow_list.title
source: Workflows
tr: İş Akışları

# workflow_list.search
source: Search workflows
tr: İş Akışı ara

# workflow_list.delete.message
source: Are you sure you want to delete %@? This action cannot be undone.
tr: %@ öğesini silmek istediğinize emin misiniz? Bu işlem geri alınamaz.

# workflow_list.create
source: Create Workflow
tr: İş Akışı Oluştur

# workflow_list.empty.message
source: No workflows yet
tr: Henüz iş akışı yok

# workflow_list.empty.action
source: Create Workflow
tr: İş Akışı Oluştur

# workflow_list.favorites_empty.message
source: No favorite workflows yet
tr: Henüz favori iş akışı yok

# workflow_list.favorites_empty.action
source: Browse All
tr: Tümünü Göster

# workflow_list.search_empty.message
source: No workflows found for '%@'
tr: '%@' için iş akışı bulunamadı

# workflow_list.filter_no_match.message
source: No workflows match the current filter
tr: Geçerli filtreyle eşleşen iş akışı bulunmuyor

# workflow_list.filter.all
source: All
tr: Tümü

# workflow_list.filter.favorites
source: Favorites
tr: Favoriler

# workflow_list.sort.name
source: Name
tr: İsim

# workflow_list.sort.modified
source: Last Modified
tr: Son Değiştirilme

# workflow_list.sort.created
source: Date Created
tr: Oluşturulma Tarihi

# workflow_list.sort.steps
source: Step Count
tr: Adım Sayısı

# workflow_list.settings
source: Settings
tr: Ayarlar

# workflow_list.history
source: History
tr: Geçmiş

# workflow.entity.steps
source: %d steps
tr: %d adım

# workflow_detail.steps
source: Steps
tr: Adımlar

# workflow_detail.description
source: Description
tr: Açıklama

# workflow_detail.info.steps
source: Steps
tr: Adımlar

# workflow_detail.info.created
source: Created
tr: Oluşturuldu

# workflow_detail.info.modified
source: Last Modified
tr: Son Değişiklik

# workflow_detail.info.favorite
source: Favorite
tr: Favori

# workflow_detail.actions.run
source: Run Workflow
tr: İş Akışını Çalıştır

# workflow_detail.actions.edit
source: Edit
tr: Düzenle

# workflow_detail.actions.favorite
source: Add to Favorites
tr: Favorilere Ekle

# workflow_detail.actions.unfavorite
source: Remove from Favorites
tr: Favorilerden Kaldır

# workflow_detail.actions.duplicate
source: Duplicate
tr: Kopyala

# workflow_detail.delete.title
source: Delete Workflow?
tr: İş Akışı Silinsin mi?

# workflow_detail.delete.message
source: This action cannot be undone. The workflow and all its steps will be permanently deleted.
tr: Bu işlem geri alınamaz. İş akışı ve tüm adımları kalıcı olarak silinecek.

# workflow_detail.empty.message
source: No steps in this workflow
tr: Bu iş akışında adım yok

# workflow_detail.empty.action
source: Add Steps
tr: Adım Ekle

# workflow_detail.duplicated.title
source: Workflow Duplicated
tr: Akış Kopyalandı

# workflow_detail.duplicated.action
source: View Copy
tr: Kopyayı Aç

# workflow_detail.duplicated.message
source: A copy of this workflow has been created.
tr: Akışın bir kopyası oluşturuldu.

# workflow_detail.duplicated.copy
source: (Copy)
tr: (Kopya)

# workflow_detail.duplicated.error
source: Failed to duplicate workflow
tr: Kopyalama işlemi başarısız

# workflow_creation.title.new
source: New Workflow
tr: Yeni İş Akışı

# workflow_creation.title.edit
source: Edit Workflow
tr: İş Akışını Düzenle

# workflow_creation.name
source: Workflow Name
tr: İş Akışı Adı

# workflow_creation.description
source: Description (optional)
tr: Açıklama (isteğe bağlı)

# workflow_creation.info
source: Workflow Info
tr: İş Akışı Bilgileri

# workflow_creation.steps.title
source: Steps
tr: Adımlar

# workflow_creation.steps.empty
source: No steps yet
tr: Henüz adım yok

# workflow_creation.steps.add
source: Add Step
tr: Adım Ekle

# workflow_creation.validation.name_required
source: Workflow name is required
tr: İş akışı adı gerekli

# workflow_creation.validation.name_short
source: Workflow name must be at least 3 characters long
tr: İş akışı adı en az 3 karakter olmalı

# workflow_creation.validation.steps_required
source: At least one step is required
tr: En az bir adım gerekli

# workflow_creation.info.footer
source: Give your workflow a descriptive name and optional description
tr: İş akışınıza açıklayıcı bir isim ve isteğe bağlı açıklama ekleyin

# workflow_creation.steps.footer
source: Steps will be executed in order. Drag to reorder.
tr: Adımlar sırayla çalıştırılır. Sıralamak için sürükleyin.

# workflow_creation.steps.count
source: %d step(s)
tr: %d adım

# step_config.title.new
source: Add Step
tr: Adım Ekle

# step_config.title.edit
source: Edit Step
tr: Adımı Düzenle

# step_config.invalid_step
source: Invalid Step
tr: Geçersiz Adım

# step_config.type
source: Step Type
tr: Adım Türü

# step_config.type.header
source: Type
tr: Tür

# step_config.type.footer
source: System Prompt
tr: Sistem Komutu

# step_config.prompt
source: Instructions
tr: Talimatlar

# step_config.prompt.footer
source: Enter specific instructions for this step. Be as detailed as possible.
tr: Bu adım için özel talimatlar girin. Mümkün olduğunca detaylı olun.

# step_config.advanced
source: Advanced Options
tr: Gelişmiş Seçenekler

# step_config.advanced.temperature.predictable
source: Predictable
tr: Tahmin Edilebilir

# step_config.advanced.temperature.creative
source: Creative
tr: Yaratıcı

# step_config.advanced.max_tokens
source: Max Tokens
tr: Maksimum Token

# step_config.advanced.max_tokens.short
source: Short
tr: Kısa

# step_config.advanced.max_tokens.long
source: Long
tr: Uzun

# step_config.advanced.sampling
source: Sampling Mode
tr: Sampling

# step_config.advanced.reset
source: Reset to Defaults
tr: Varsayılanlara Sıfırla

# step_config.advanced.footer
source: Temperature controls creativity (0.0=predictable, 2.0=creative). Max tokens limits response length. Sampling mode affects output determinism.
tr: Temperature, yaratıcılığı kontrol eder (0.0=tahmin edilebilir, 2.0=yaratıcı). Maksimum token, yanıt uzunluğunu sınırlar. Sampling, çıktı belirginliğini etkiler.

# step_config.test
source: Test Step
tr: Adımı Test Et

# step_config.test.input
source: Test Input
tr: Test Girdisi

# step_config.test.output
source: Output:
tr: Çıktı:

# step_config.test.testing
source: Testing step...
tr: Test ediliyor...

# step_config.test.run
source: Test Step
tr: Adımı Test Et

# step_config.test.footer
source: Test your step configuration with sample input before saving.
tr: Kaydetmeden önce adım yapılandırmanızı örnek girdi ile test edin.

# step_config.preview
source: Full Prompt Preview
tr: Tam İstem Önizlemesi

# step_config.validation.empty
source: Prompt cannot be empty
tr: İstem boş olamaz

# step_config.validation.short
source: Prompt must be at least 3 characters long
tr: İstem en az 3 karakter olmalı

# step_config.validation.temperature
source: Temperature must be between 0.0 and 2.0
tr: Temperature ayarı 0.0 ile 2.0 arasında olmalı

# step_config.validation.tokens
source: Max tokens must be between 1 and 4096
tr: Maksimum token sayısı 1 ile 4096 arasında olmalı

# step_config.validation.testInput
source: Test input cannot be empty
tr: Test girdisi boş olamaz

# step_type.summarize
source: Summarize
tr: Özetle

# step_type.translate
source: Translate
tr: Çevir

# step_type.extract
source: Extract Information
tr: Bilgi Çıkar

# step_type.rewrite
source: Rewrite
tr: Yeniden Yaz

# step_type.analyze
source: Analyze
tr: Analiz Et

# step_type.custom
source: Custom
tr: Özel

# step_type.system_prompt.summarize
source: Summarize the following text concisely:
tr: Aşağıdaki metni öz ve net bir şekilde özetle:

# step_type.system_prompt.translate
source: Translate the following text:
tr: Aşağıdaki metni çevir:

# step_type.system_prompt.extract
source: Extract the requested information from the text:
tr: Metinden istenen bilgileri çıkar:

# step_type.system_prompt.rewrite
source: Rewrite the following text:
tr: Aşağıdaki metni yeniden yaz:

# step_type.system_prompt.analyze
source: Analyze the following text:
tr: Aşağıdaki metni analiz et:

# live_activity.starting
source: Starting...
tr: Başlatılıyor...

# execution.title
source: Run Workflow
tr: İş Akışını Çalıştır

# execution.input
source: Input Text
tr: Girdi Metni

# execution.input.characters
source: %d characters
tr: %d karakter

source: Execution Progress
tr: Çalıştırma İlerlemesi

# execution.results
source: Results
tr: Sonuçlar

# execution.results.status
source: Status
tr: Durum

# execution.results.duration
source: Duration
tr: Süre

# execution.results.steps_completed
source: Steps Completed
tr: Tamamlanan Adımlar

# execution.results.output
source: Final Output
tr: Son Çıktı

# execution.actions.copy
source: Copy Output
tr: Çıktıyı Kopyala

# execution.actions.run_again
source: Run Again
tr: Tekrar Çalıştır

# execution.status.running
source: Running
tr: Çalışıyor

# execution.status.completed
source: Completed
tr: Tamamlandı

# execution.status.failed
source: Failed
tr: Başarısız

# execution.status.cancelled
source: Cancelled
tr: İptal Edildi

# execution.live_activity.enabled
source: Live Activity enabled
tr: Canlı Aktivite etkin

# execution.error.title
source: Execution Failed
tr: Çalıştırma Başarısız

# workflow_step.advanced.greedy
source: Greedy
tr: Deterministik

# workflow_step.advanced.greedy_description
source: Deterministic (same output for same input)
tr: Aynı girdide her zaman aynı çıktıyı üretir

# workflow_step.advanced.random
source: Random
tr: Rastgele

# workflow_step.advanced.random_description
source: Creative (varied outputs)
tr: Daha yaratıcıdır (değişken çıktılar üretir)

# history.title
source: Execution History
tr: Çalıştırma Geçmişi

# history.search
source: Search executions
tr: Çalıştırmaları ara

# history.empty.message
source: No execution history yet
tr: Henüz çalıştırma geçmişi yok

# history.empty.success
source: No successful executions yet
tr: Henüz başarılı çalıştırma yok

# history.empty.failed
source: No failed executions yet
tr: Henüz başarısız çalıştırma yok

# history.empty.search
source: No executions found for '%@'
tr: '%@' için çalıştırma bulunamadı

# history.empty.no_matched_filter
source: No executions match the current filter
tr: Geçerli filtreyle eşleşen hiçbir çalıştırma yok

# history.statistics
source: Statistics
tr: İstatistikler

# history.statistics.total
source: Total
tr: Toplam

# history.statistics.success
source: Success
tr: Başarılı

# history.statistics.failed
source: Failed
tr: Başarısız

# history.filter.all
source: All
tr: Tümü

# history.filter.success
source: Successful
tr: Başarılı

# history.filter.failed
source: Failed
tr: Başarısız

# history.sort.newest
source: Newest First
tr: Yeniden Eskiye

# history.sort.oldest
source: Oldest First
tr: Eskiden Yeniye

# history.sort.duration
source: Duration
tr: Süre

# history.sort.name
source: Workflow Name
tr: İş Akışı Adı

# history.delete_all.title
source: Delete All History
tr: Tüm Geçmişi Sil

# history.delete_all.message
source: This will permanently delete all execution history. This action cannot be undone.
tr: Bu işlem tüm çalıştırma geçmişini kalıcı olarak silecek. Bu işlem geri alınamaz.

# history.detail.title
source: Execution Details
tr: Çalıştırma Detayları

# history.detail.workflow
source: Workflow
tr: İş Akışı

# history.detail.duration
source: Duration
tr: Süre

# history.detail.executed
source: Executed
tr: Çalıştırıldı

# history.detail.input
source: Input Text
tr: Girdi Metni

# history.detail.steps
source: Step Results
tr: Adım Sonuçları

# history.detail.output
source: Final Output
tr: Son Çıktı

# history.share_text.title
source: Workflow Execution Report
tr: Workflow Çalıştırma Raporu

# history.share_text.date
source: Date
tr: Tarih

# history.share_text.input
source: INPUT
tr: GİRİŞ

# settings.title
source: Settings
tr: Ayarlar

# settings.ai_service
source: AI Service
tr: AI Hizmeti

# settings.ai_service.description
source: Powered by Apple's Foundation Models API. All processing happens on your device using on-device language model.
tr: Apple'ın Foundation Models API’si tarafından desteklenir. Tüm işlemler cihazınızdaki yerel dil modeli kullanılarak cihaz üzerinde gerçekleştirilir.

# settings.ai_service.status
source: On-Device AI
tr: Cihaz İçi Yapay Zeka

# settings.ai_service.available
source: AI processing is available on this device
tr: AI işleme bu cihazda kullanılabilir

# settings.ai_service.privacy.local
source: All workflows run locally with complete privacy
tr: Tüm iş akışları tam gizlilikle yerel olarak çalışır

# settings.ai_service.privacy.offline
source: Works offline - no internet required
tr: Çevrimdışı çalışır - internet bağlantısı gerekmez

# settings.ai_service.unavailable
source: AI processing is not available
tr: AI işleme kullanılamıyor

# settings.ai_service.requirements
source: Requirements:
tr: Gereksinimler:

# settings.ai_service.requirements.ios
source: • iOS 26.0 or later
tr: • iOS 26.0 veya üzeri

# settings.ai_service.requirements.intelligence
source: • Apple Intelligence enabled
tr: • Apple Intelligence etkin

# settings.ai_service.requirements.device
source: • Compatible device
tr: • Uyumlu cihaz

# settings.test.configuration.title
source: Test Configuration
tr: Test Yapılandırması

# settings.test.configuration.streaming
source: Use Streaming
tr: Streaming Kullan

# settings.test.configuration.structured
source: Use Structured Output
tr: Yapılandırılmış Çıktı Kullan

# settings.test.prompt.title
source: Test Prompt
tr: Test Promptu

# settings.test.prompt.message
source: Summarize the following text in 2-3 sentences: SwiftUI is Apple's modern framework for building user interfaces across all Apple platforms.
tr: Aşağıdaki metni 2-3 cümlede özetleyin: SwiftUI, Apple’ın tüm platformlarında kullanıcı arayüzleri oluşturmak için geliştirdiği modern bir çerçevedir.

# settings.test.prompt.quick
source: Quick Prompts
tr: Hızlı Prompts

# settings.test.prompt.summarize_tag
source: Summarize the following text: SwiftUI is Apple's modern framework...
tr: Aşağıdaki metni özetleyin: SwiftUI, Apple’ın modern kullanıcı arayüzü çerçevesi...

# settings.test.prompt.extract_tag
source: Extract email addresses and phone numbers from: Contact John at john@example.com or call 555-1234
tr: Şuradan e-posta adreslerini ve telefon numaralarını çıkarın: John’a john@example.com adresinden ulaşın veya 555-1234’ü arayın

# settings.test.prompt.analyze_tag
source: Analyze the sentiment and tone of: I absolutely love this new feature!
tr: Şunu analiz edin (duygu ve ton): Bu yeni özelliği kesinlikle çok sevdim!

# settings.test.response.title
source: Response
tr: Yanıt

# settings.test.response.processing
source: Processing...
tr: İşleniyor...

# settings.test.response.no_response
source: No response yet
tr: Henüz yanıt yok

# settings.test.execute_propmt
source: Execute Prompt
tr: Promptu Çalıştır

# settings.preferences
source: Preferences
tr: Tercihler

# settings.preferences.theme
source: Theme
tr: Tema

# settings.preferences.theme.light
source: Light
tr: Açık

# settings.preferences.theme.dark
source: Dark
tr: Koyu

# settings.preferences.theme.system
source: System
tr: Sistem

# settings.widgets
source: Widgets
tr: Widget'lar

# settings.widgets.preferences
source: Widget Preferences
tr: Widget Tercihleri

# settings.widgets.description
source: Configure which workflows appear in your home screen widget
tr: Ana ekran widget'ınızda hangi iş akışlarının görüneceğini yapılandırın

# settings.siri
source: Siri & Shortcuts
tr: Siri ve Kısayollar

# settings.siri.manage
source: Manage Shortcuts
tr: Kısayolları Yönet

# settings.privacy
source: Privacy
tr: Gizlilik

# settings.privacy.ondevice.title
source: 100% On-Device Processing
tr: 100% Cihaz İçi İşleme

# settings.privacy.ondevice.description
source: All AI runs locally on your iPhone
tr: Tüm AI iPhone'unuzda yerel olarak çalışır

# settings.privacy.nodata.title
source: Zero Data Collection
tr: Sıfır Veri Toplama

# settings.privacy.nodata.description
source: Your data never leaves your device
tr: Verileriniz asla cihazınızdan ayrılmaz

# settings.privacy.offline.title
source: Works Offline
tr: Çevrimdışı Çalışır

# settings.privacy.offline.description
source: No internet connection required
tr: İnternet bağlantısı gerekmez

# settings.about
source: About
tr: Hakkında

# settings.about.version
source: Version
tr: Sürüm

# settings.about.build
source: Build
tr: Yapı

# settings.about.test
source: Test AI Service
tr: AI Hizmetini Test Et

# settings.technology
source: Technology
tr: Teknoloji

# settings.technology.framework
source: Framework
tr: Çatı

# settings.technology.architecture
source: Architecture
tr: Mimari

# settings.technology.architecture.value
source: On-Device LLM
tr: Cihaz İçi LLM

# widget_preferences.title
source: Widget Preferences
tr: Widget Tercihleri

# widget_preferences.header
source: Widget Workflows
tr: Widget İş Akışları

# widget_preferences.description
source: Select up to 4 workflows to display
tr: Görüntülenecek 4 iş akışına kadar seçin

# widget_preferences.selected
source: %d of 4 selected
tr: 4'ten %d seçili

# widget_preferences.available
source: Available Workflows
tr: Kullanılabilir İş Akışları

# widget_preferences.footer
source: Selected workflows will appear in your home screen widget. Changes take effect immediately.
tr: Seçili iş akışları ana ekran widget'ınızda görünecektir. Değişiklikler hemen geçerli olur.

# widget_preferences.empty.title
source: No Workflows Available
tr: Kullanılabilir İş Akışı Yok

# widget_preferences.empty.message
source: Create workflows in the app first
tr: Önce uygulamada iş akışları oluşturun

# widget_preferences.limit_reached
source: Widget can only show 4 workflows maximum
tr: Widget en fazla 4 iş akışı gösterebilir

# widget_preferences.not_found
source: Preferences not found
tr: Tercihler bulunamadı

# widget_preferences.save_failed
source: Failed to save preferences
tr: Tercihler kaydedilemedi

# siri.title
source: Siri Shortcuts
tr: Siri Kısayolları

# siri.description
source: Run workflows with voice commands.
tr: Sesli komutlarla iş akışlarını çalıştırın.

# siri.available
source: Available Workflows
tr: Kullanılabilir İş Akışları

# siri.empty_workflow
source: No workflows available
tr: Herhangi bir iş akışı bulunmuyor

# siri.commands
source: Voice Commands
tr: Sesli Komutlar

# siri.commands.examples
source: Examples:
tr: Örnekler:

# siri.commands.example1
source: Run Summarize & Translate
tr: Özetle ve Çevir çalıştır

# siri.commands.example2
source: Execute my workflow
tr: İş akışımı çalıştır

# siri.commands.example3
source: Process text with [workflow name]
tr: [iş akışı adı] ile metni işle

# siri.howto
source: How To Use
tr: Nasıl Kullanılır

# siri.howto.step1.title
source: Say 'Hey Siri'
tr: 'Hey Siri' deyin

# siri.howto.step1.description
source: Activate Siri on your device
tr: Cihazınızda Siri'yi etkinleştirin

# siri.howto.step2.title
source: Say the command
tr: Komutu söyleyin

# siri.howto.step2.description
source: Use one of the voice command above
tr: Yukarıdaki sesli komutlardan birini kullanın

# siri.howto.step3.title
source: Provide input
tr: Girdi sağlayın

# siri.howto.step3.description
source: Siri will ask for the text to process
tr: Siri işlenecek metni soracak

# error.workflow_not_found
source: Workflow not found
tr: İş akışı bulunamadı

# error.no_steps
source: Workflow has no steps
tr: İş akışında adım yok

# error.empty_input
source: Input text cannot be empty
tr: Girdi metni boş olamaz

# error.step_failed
source: Step %d failed: %@
tr: Adım %d başarısız: %@

# error.execution_cancelled
source: Execution was cancelled
tr: Çalıştırma işlemi iptal edildi

# error.execution_failed
source: Workflow execution failed
tr: İş akışı çalıştırması başarısız

# error.execution.delete_failed
source: Failed to delete execution: %@
tr: Çalıştırma silinirken hata oluştu: %@

# error.execution.delete_all
source: Failed to delete all: %@
tr: Tümü silinirken hata oluştu: %@

# error.ai_unavailable
source: AI service is not available on this device.
tr: AI hizmeti bu cihazda kullanılamıyor

# error.save_failed
source: Failed to save workflow
tr: İş akışı kaydedilemedi

# error.delete_failed
source: Failed to delete workflow
tr: İş akışı silinemedi

# error.preferences_failed
source: Failed to load preferences
tr: Tercihler yüklenemedi

# error.ai_model_unavailable
source: AI model is not available on this device. Requires iOS 26+ and A17 Pro chip or later.
tr: Bu cihazda AI modeli kullanılamıyor. iOS 26+ ve A17 Pro veya daha yeni bir çip gerektirir.

# error.ai_invalid_response
source: Received an invalid response from the AI model.
tr: AI modelinden geçersiz bir yanıt alındı.

# error.ai_execution_failed
source: AI execution failed: %@
tr: AI çalıştırma hatası: %@

# error.ai_cancelled
source: AI execution was cancelled.
tr: AI çalıştırma işlemi iptal edildi.

# error.theme.update_failed
source: Failed to update theme
tr: Tema güncellenemedi

# error.workflow.set_failed
source: Failed to set default workflow
tr: Varsayılan çalışma akışı ayarlanamadı

# error.widget.add_failed
source: Failed to add widget selected
tr: Seçilen widget eklenemedi

# error.widget.remove_failed
source: Failed to remove widget selected
tr: Seçilen widget kaldırılamadı

# error.invalid_workflow
source: Invalid Workflow
tr: Geçersiz İş Akışı

# error.favorite_update_failed
source: Failed to update favorite
tr: Favori güncellenemedi

# summary_result.summary
source: A concise summary in 2-3 sentences
tr: 2-3 cümlelik kısa özet

# summary_result.keyPoints
source: 3-5 key points from the text
tr: Metinden 3-5 anahtar nokta

# summary_result.sentiment
source: Overall sentiment: positive, negative, or neutral
tr: Genel duygu: pozitif, negatif veya nötr

# extracted_info.emails
source: List of email addresses found
tr: Bulunan e-posta adresleri listesi

# extracted_info.phoneNumbers
source: List of phone numbers found
tr: Bulunan telefon numaraları listesi

# extracted_info.dates
source: List of dates mentioned
tr: Belirtilen tarihler listesi

# extracted_info.names
source: List of names or entities found
tr: Bulunan isimler veya varlıklar listesi

# translation_result.translatedText
source: The translated text
tr: Çevrilmiş metin

# translation_result.sourceLanguage
source: Source language detected
tr: Algılanan kaynak dil

# translation_result.targetLanguage
source: Target language
tr: Hedef dil

# analysis_result.tone
source: Overall tone of the text
tr: Metnin genel tonu

# analysis_result.themes
source: Main themes identified
tr: Belirlenen ana temalar

# analysis_result.complexity
source: Complexity level: simple, moderate, or complex
tr: Zorluk seviyesi: basit, orta veya karmaşık

# analysis_result.insights
source: Key insights from the analysis
tr: Analizden çıkarılan önemli bulgular
